DataProcessors/Отчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>Отчеты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ТипыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Долги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сторно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Отчеты/Forms/НастройкиОтбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Период") Тогда 
		Период = Параметры.Период;
	Иначе
		Элементы.Период.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборВалюта") Тогда 
		ОтборВалюта.ЗагрузитьЗначения(Параметры.ОтборВалюта.ВыгрузитьЗначения());
	Иначе
		Элементы.ОтборВалюта.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборКошелек") Тогда 
		ОтборКошелек.ЗагрузитьЗначения(Параметры.ОтборКошелек.ВыгрузитьЗначения());
	Иначе
		Элементы.ОтборКошелек.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборМетка") Тогда 
		ОтборМетка.ЗагрузитьЗначения(Параметры.ОтборМетка.ВыгрузитьЗначения());
	Иначе
		Элементы.ОтборМетка.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборСтатья") Тогда 
		ОтборСтатья.ЗагрузитьЗначения(Параметры.ОтборСтатья.ВыгрузитьЗначения());
	Иначе
		Элементы.ОтборСтатья.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборТипОперации") Тогда 
		ОтборТипОперации.ЗагрузитьЗначения(Параметры.ОтборТипОперации.ВыгрузитьЗначения());
	Иначе
		Элементы.ОтборТипОперации.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборФизлицо") Тогда 
		ОтборФизЛицо.ЗагрузитьЗначения(Параметры.ОтборФизЛицо.ВыгрузитьЗначения());
	Иначе
		Элементы.ОтборФизЛицо.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Период2") Тогда 
		Период2 = Параметры.Период2;
	Иначе
		Элементы.Период2.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборМеткаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Обработка.Отчеты.Форма.ФормаВыбора", Новый Структура("ИмяМетаданных, Список", "Справочник.Метки",
	ОтборМетка.ВыгрузитьЗначения()), ЭтаФорма, , , , Новый ОписаниеОповещения("ОтборВыборЗавершение", ЭтотОбъект, ОтборМетка),
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	спис = Новый СписокЗначений;
	ОтборТипОперацииНачалоВыбораСерв(спис);
	
	ОткрытьФорму("Обработка.Отчеты.Форма.ФормаВыбора", Новый Структура("ИмяМетаданных, Список", "Перечисление.ТипыОпераций",
	ОтборТипОперации.ВыгрузитьЗначения()), ЭтаФорма, , , , Новый ОписаниеОповещения("ОтборВыборЗавершение", ЭтотОбъект, ОтборТипОперации),
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОтборКошелекНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Обработка.Отчеты.Форма.ФормаВыбора", Новый Структура("ИмяМетаданных, Список", "Справочник.Кошельки",
	ОтборКошелек.ВыгрузитьЗначения()), ЭтаФорма, , , , Новый ОписаниеОповещения("ОтборВыборЗавершение", ЭтотОбъект, ОтборКошелек),
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатьяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Обработка.Отчеты.Форма.ФормаВыбора", Новый Структура("ИмяМетаданных, Список, Дерево", "Справочник.Статьи",
	ОтборСтатья.ВыгрузитьЗначения(), Истина), ЭтаФорма, , , , Новый ОписаниеОповещения("ОтборВыборЗавершение", ЭтотОбъект, ОтборСтатья),
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОтборВалютаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Обработка.Отчеты.Форма.ФормаВыбора", Новый Структура("ИмяМетаданных, Список", "Справочник.Валюты",
	ОтборВалюта.ВыгрузитьЗначения()), ЭтаФорма, , , , Новый ОписаниеОповещения("ОтборВыборЗавершение", ЭтотОбъект, ОтборВалюта),
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОтборФизЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Обработка.Отчеты.Форма.ФормаВыбора", Новый Структура("ИмяМетаданных, Список", "Справочник.ФизЛица",
	ОтборВалюта.ВыгрузитьЗначения()), ЭтаФорма, , , , Новый ОписаниеОповещения("ОтборВыборЗавершение", ЭтотОбъект, ОтборФизЛицо),
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОтборВыборЗавершение(Результат, ДопПараметры) Экспорт 
	Если ТипЗнч(Результат) = Тип("СписокЗначений") Тогда 
		ДопПараметры.ЗагрузитьЗначения(Результат.ВыгрузитьЗначения());
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	СтруктаНастроек = Новый Структура;
	СтруктаНастроек.Вставить("Период", Период);
	СтруктаНастроек.Вставить("Период2", Период2);
	СтруктаНастроек.Вставить("ОтборВалюта", ОтборВалюта);
	СтруктаНастроек.Вставить("ОтборКошелек", ОтборКошелек);
	СтруктаНастроек.Вставить("ОтборМетка", ОтборМетка);
	СтруктаНастроек.Вставить("ОтборСтатья", ОтборСтатья);
	СтруктаНастроек.Вставить("ОтборТипОперации", ОтборТипОперации);
	СтруктаНастроек.Вставить("ОтборФизЛицо", ОтборФизЛицо);
	ЭтаФорма.Закрыть(СтруктаНастроек);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтборТипОперацииНачалоВыбораСерв(спис)
	спис.Добавить(Перечисления.ТипыОпераций.Долги);
	спис.Добавить(Перечисления.ТипыОпераций.Перевод);
КонецПроцедуры

#КонецОбласти
